app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at Desc')
---
SELECT "posts".* FROM "posts" ORDER BY created_at Desc

  def update
    @post = Post.find(params[:id])

    if @post.update(params[:post].permit(:title, :body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Lorem ipsum dolor"], ["updated_at", "2017-08-31 18:05:34.111312"], ["id", 4]]